app/Controllers/AdminProduk.php

SELECT *
FROM `kategori`
---
    public function add()
    {
        session();
        $kategori = $this->mKategori->findAll();

SELECT *
FROM `kategori`
SELECT *
FROM `produk`
WHERE `id_produk` = '20129'
 LIMIT 1
---
    public function edit($id)
    {
        $kategori           = $this->mKategori->findAll();
        $produk             = $this->mProduk->where(['id_produk' => $id])->first();