app/Controllers/AdminKategori.php

    public function index()
    {
        $data = [
            'title'     => 'Kategori',
            'kategori'  =>  $this->mKategori->findAll(),
---
SELECT *
FROM `kategori`

    public function detail($id)
    {
        $kategori = $this->mKategori->where(['id_kategori' => $id])->first();
---
SELECT *
FROM `kategori`
WHERE `id_kategori` = '9'
 LIMIT 1