app/Controllers/Home.php

SELECT `auth_groups`.`name` as `role`
FROM `auth_groups`
JOIN `auth_groups_users` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
JOIN `users` ON `auth_groups_users`.`user_id` = `users`.`id`
WHERE `users`.`id` = 10314
---
    public function cekrole($iduser){
        $this->builder = $this->db->table('auth_groups ');
        $this->builder->select('auth_groups.name as role');
        $this->builder->join('auth_groups_users ', 'auth_groups.id = auth_groups_users.group_id');
        $this->builder->join('users', 'auth_groups_users.user_id = users.id');
        $this->builder->where('users.id = '. $iduser);
        $query = $this->builder->get();

SELECT *
FROM `produk`
WHERE `id_produk` = '20131'
 LIMIT 1
---
    public function detailtour($id_produk)
    {
        $iduser = user()->id ?? null;
        $role = $this->cekrole($iduser);
        $rolee = $role->role ?? null;

        $produk = $this->mProduk->where(['id_produk' => $id_produk])->first();