app/Models/M_Produk.php

    public function getProdukPredictions()
    {
        $ratingProduk = new M_Rating();
        $ratingProduk = $ratingProduk->select('id_produk')
            ->distinct('id_produk')
            ->get()
            ->getResultArray();

        foreach ($ratingProduk as $key => $value) {
            $id_produks[$key] = $value['id_produk'];
        }

        return $this->whereIn('id_produk', $id_produks)
            ->findAll();
---
SELECT DISTINCT `id_produk`
FROM `rating`
SELECT *
FROM `produk`
WHERE `id_produk` IN ('20121','20128','20129','20130','20131','20132','20133')

    public function getProdukKategori()
    {
        $query =  $this->db->table('produk')
        ->select('*')
        ->join('kategori', 'kategori.id_kategori = produk.id_kategori')
        ->get();
---
SELECT *
FROM `produk`
JOIN `kategori` ON `kategori`.`id_kategori` = `produk`.`id_kategori`

    public function getratingfirst($id_produk){
        $query =  $this->db->table('rating')
        ->select('fullname, komentar, nilai_rating, id_rating, rating.id_produk as idproduk')
        ->join('users', 'rating.id = users.id')
        ->where('rating.id_produk =' . $id_produk)
        ->orderBy('id_rating', 'DESC')
        ->get();
---
SELECT `fullname`, `komentar`, `nilai_rating`, `id_rating`, `rating`.`id_produk` as `idproduk`
FROM `rating`
JOIN `users` ON `rating`.`id` = `users`.`id`
WHERE `rating`.`id_produk` = 20131
ORDER BY `id_rating` DESC