app/Models/M_Prediksi.php

SELECT *
FROM `prediksi`
WHERE `id_user` = 10312
AND `id_produk` = 20131
---
    public function getPredictionOf($id_user, $id_produk)
    {
        return $this->where('id_user', $id_user)
            ->where('id_produk', $id_produk)
            ->findAll();

INSERT INTO `prediksi` (`id_user`, `id_produk`, `nilai_mae`) VALUES (10312, 20131, 0.62639342289244)
---
    public function insertMae($id_user, $id_produk, $mae)
    {
        return $this->insert([
            'id_user'   => $id_user,
            'id_produk' => $id_produk,
            'nilai_mae' => $mae
        ]);