app/Models/M_Rating.php

SELECT *
FROM `rating`
WHERE id IS NOT NULL
AND id_produk IS NOT NULL
---
    public function getRatingPredictions()
    {
        return $this->where('id IS NOT NULL', null, false)
            ->where('id_produk IS NOT NULL', null, false)
            ->findAll();

SELECT `id_rating`, `username`, `fullname`, `nama_produk`, `nilai_rating`, `komentar`
FROM `rating`
JOIN `produk` ON `produk`.`id_produk` = `rating`.`id_produk`
JOIN `users` ON `users`.`id` = `rating`.`id`
---
    public function getRatingInfo()
    {
        $query =  $this->db->table('rating')
        ->select('id_rating, username, fullname, nama_produk, nilai_rating, komentar')
        ->join('produk', 'produk.id_produk = rating.id_produk')
        ->join('users', 'users.id = rating.id')
        ->get();