app/Models/M_User.php

    public function getUserPredictions()
    {
        $ratingUser = new M_Rating();
        $ratingUser = $ratingUser->select('id')
            ->distinct('id')
            ->get()
            ->getResultArray();

        foreach ($ratingUser as $key => $value) {
            $id_users[$key] = $value['id'];
        }

        return $this->whereNotIn('username', $this->usernameExcludes)
            ->whereIn('id', $id_users)
            ->findAll();
---
SELECT DISTINCT `id`
FROM `rating`
SELECT *
FROM `users`
WHERE `username` NOT IN ('admin')
AND `id` IN ('10312','10314','10316','10313','4','10317','10318','10319','10320','10321')