app/Libraries/Prediction.php

    function user()
    {
        return $this->userIdRated ? $this->mUser->find($this->userIdRated) : null;
---
SELECT *
FROM `users`
WHERE `users`.`id` = '10314'

    function update_mae_product()
    {
        foreach ($this->maes->recomendations_for_guest as $id => $recomendation) {
            $this->mProduk->update($id, [
                $this->mProduk->maeColumnName => $recomendation
            ]);
---
UPDATE `produk` SET `nilai_mae` = 0.4343171974876, `updated_at` = '2024-08-26 01:47:13'
WHERE `produk`.`id_produk` IN (20130)